{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "model_type": "llama",
  "hidden_size": 5120,
  "intermediate_size": 25600,
  "num_hidden_layers": 1,
  "num_attention_heads": 64,
  "num_key_value_heads": 8,
  "head_dim": 128,
  "vocab_size": 151936,
  "draft_vocab_size": 32000,
  "rope_theta": 1000000,
  "rms_norm_eps": 1e-06,
  "torch_dtype": "bfloat16",
  "tie_word_embeddings": false
}